tap "charmbracelet/tap"
tap "oven-sh/bun"
tap "sst/tap"

# Basic packages
brew "stow"
brew "curl"
brew "wget"

# Dev tools
brew "neovim"
brew "tmux"
brew "direnv"
brew "mise"
brew "grpcurl"
brew "vim"
brew "cmake"
brew "ast-grep"
brew "nfpm"
brew "buf"
brew "protobuf"

# LLMs
brew "opencode"
brew "crush"
brew "gemini-cli"
cask "codex"
cask "copilot-cli"

# Languages
brew "go"
brew "rust"
brew "rust-analyzer"
brew "zig"
brew "hugo"
brew "yaml-language-server"

# Fancy CLI tools
brew "zoxide"
brew "ripgrep"
brew "btop"
brew "htop"
brew "eza"
brew "fd"
brew "fzf"
brew "bat"
brew "fastfetch"
brew "multitail"
brew "watch"
brew "the_silver_searcher"
brew "thefuck"
brew "uv"
brew "bun"
brew "nushell"
brew "rclone"
brew "nmap"
brew "yq"
brew "yazi"

# Cloud & Infrastructure
brew "awscli"
brew "aws-iam-authenticator"
brew "pulumi"
brew "tfenv"
brew "serverless"
brew "act"
brew "axel"
brew "ansible"

# Kubernetes
brew "kubectx"
brew "kubecm"
brew "k9s"
brew "helm"
brew "helm-ls"
brew "istioctl"
brew "kubeseal"
brew "kind"
brew "eksctl"

# Docker
brew "lazydocker"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"

# Version control & Git tools
brew "lazyjj"
brew "gh"
brew "lazygit"
brew "git-delta"
brew "difftastic"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"

# Apps without casks: SoundSource, AlDente, Ghostty

