# Basic packages
brew "git"
brew "stow"
brew "readline"
brew "ncurses"
brew "ca-certificates"
brew "curl"
brew "wget"

# Dev tools
brew "neovim"
brew "grep"
brew "tmux"
brew "direnv"
brew "mise"

# Fancy CLI tools
brew "zoxide"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "btop"
brew "htop"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"

# Docker
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-completion"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"

# Apps without casks: SoundSource, AlDente, Ghostty

